Revit 2024 API
Gradient.GradientColor Property
 The property labeled "Color" from the "Gradient" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018.1
Syntax
C#
public static string GradientColor { get; }
Visual Basic
Public Shared ReadOnly Property GradientColor As String
	Get
Visual C++
public:
static property String^ GradientColor {
	String^ get ();
}
Remarks
 This property is a "AssetPropertyList" of type "AssetPropertyDoubleArray4d".
See Also
Gradient Class
Autodesk.Revit.DB.Visual Namespace